Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: Overall, { -brand-name-brave } is a fast and secure browser that will have particular appeal to cryptocurrency users. But for the vast majority of internet citizens, { -brand-name-firefox } remains a better and simpler solution.
am: ባጠቃላይ፣ { -brand-name-brave } ፈጣን እና ደህንነቱ የተጠበቀ አሳሽ ሲሆን በተለይ ለ cryptocurrency ተጠቃሚዎች የሚስብ ነው። ግን ለአብዛኛዎቹ የበይነመረብ ዜጎች { -brand-name-firefox } የተሻለ እና ቀላል መፍትሄ ሆኖ ይቆያል።

source: Overall, { -brand-name-opera } is a solid browser, with a clean interface and a lot of useful features available. There are, however, some serious privacy concerns as well as an issue with it using a lot of processing power. Although { -brand-name-opera } has some really terrific ease of use features, we still believe { -brand-name-firefox } remains a superior browser based on performance and with a transparent user-privacy stance and strict privacy protections.
am: በአጠቃላይ፣ { -brand-name-opera } ጠንካራ አሳሽ ነው፣ ንጹህ በይነገጽ ያለው እና ብዙ ጠቃሚ ባህሪያት ይገኛል። ሆኖም አንዳንድ ከባድ የግላዊነት ስጋቶች እና ብዙ የማቀናበር ሃይልን በመጠቀም ላይ ያሉ ችግሮች አሉ። ምንም እንኳን { -brand-name-opera } ምንም እንኳን እጅግ በጣም ጥሩ የአጠቃቀም ቀላል ባህሪያት ቢኖረውም አሁንም { -brand-name-firefox } በአፈጻጸም ላይ የተመሰረተ እና ግልጽ የተጠቃሚ-ግላዊነት አቋም እና ጥብቅ የግላዊነት ጥበቃዎች የላቀ አሳሽ እንደሆነ እናምናለን።

source: Overview
am: አጠቃላይ እይታ

source: Password management
am: የይለፍ ቃል አስተዳደር

source: Password manager
am: የይለፍ ቃል አስተዳዳሪ

source: People contributed to { -brand-name-mozilla } in different ways, but everyone was passionate about creating free software that would enable people to have a choice in how they experienced the internet.
am: ሰዎች ለ{ -brand-name-mozilla } በተለያየ መንገድ አስተዋጽዖ አበርክተዋል፣ ነገር ግን ሁሉም ሰው በይነመረቡን እንዴት እንደሚለማመዱ ምርጫ እንዲኖራቸው የሚያስችል ነጻ ሶፍትዌር ለመፍጠር ጓጉቷል።

source: Personalize { -brand-name-firefox } with your favorite extras like password managers, ad blockers and more.
am: { -brand-name-firefox }ን እንደ የይለፍ ቃል አስተዳዳሪዎች፣ ማስታወቂያ አጋጆች እና ሌሎች ተወዳጅ ተጨማሪዎች ያብጁ።

source: Phone masking
am: የስልክ ጭንብል

source: Please follow <a href="{ $url }">these instructions</a> to install { -brand-name-firefox }.
am: { -brand-name-firefox }ን ለመጫን እባክዎ <a href="{ $url }">እነዚህን መመሪያዎች</a> ይከተሉ።

source: Popup ads are the worst. Block them with <a href="{ $url }">Popup Blocker</a> and never deal with another annoying popup again.
am: ብቅ ባይ ማስታወቂያዎች በጣም የከፋ ናቸው። በ <a href="{ $url }"> ብቅ ባይ ማገጃ </a> አግ Blockቸው እና እንደገናም ሌላ አሰቃቂ ብቅ-ባይን በጭራሽ አያነጋግሩ።

source: Portability
am: ተንቀሳቃሽነት

source: Portions of this content are ©1998–{ $current_year } by individual mozilla.org contributors. Content available under a <a rel="license" href="{ $url }">{ -brand-name-creative-commons } license</a>.
am: የዚህ ይዘት ክፍሎች ©1998–{ $current_year } በእያንዳንዱ የmozilla.org አበርካቾች ስም ነው። ይዘቱ በ<a rel="license" href="{ $url }">{ -brand-name-creative-commons } ፍቃድ</a> ስር ይገኛል።

source: Press
am: ይጫኑ

source: Press Center
am: የህትመት ማዕከል

source: Preview the latest build of { -brand-name-firefox } and help us make it the best.
am: የቅርብ ጊዜውን የ{ -brand-name-firefox } ግንባታ አስቀድመው ይመልከቱ እና ምርጡን እንድናደርገው ያግዙን።

source: Primary password
am: ዋና የይለፍ ቃል

source: Privacy first
am: ግላዊነት መጀመሪያ

source: Privacy has become a white hot topic for tech companies as they realize more and more people are feeling vulnerable to things like data breaches, ad trackers and hackers. But when it comes down to the real tools people use to navigate the actual interwebs, is it all talk or are they actually taking action to keep your data secure?
am: ከጊዜ ወደ ጊዜ እየጨመረ የሚሄደው ሰዎች እንደ የውሂብ ጥሰት፣ የማስታወቂያ መከታተያዎች እና ሰርጎ ገቦች ለመሳሰሉት ነገሮች ተጋላጭ እንደሆኑ ሲገነዘቡ ግላዊነት ለቴክኖሎጂ ኩባንያዎች ትኩስ ርዕስ ሆኗል። ነገር ግን ሰዎች ትክክለኛውን የበይነመረብ ድረ-ገጽ ለማሰስ የሚጠቀሙባቸው ትክክለኛ መሳሪያዎች ላይ ስንመጣ፣ ሁሉም ወሬ ነው ወይንስ የእርድዎን ውሂብ ደህንነቱ የተጠበቀ ለማድረግ እርምጃ እየወሰዱ ነው?

source: Privacy Hub
am: የግላዊነት ማዕከል

source: Privacy Promise
am: የግላዊነት ቃል-ኪዳን

source: Privacy. Utility. Portability.
am: ግላዊነት። መገልገያ። ተንቀሳቃሽነት።

source: Privacy you can trust
am: ሊያምኑት የሚችሉት ግላዊነት

source: Private Browsing
am: የግል አሰሳ

source: Problems with a web page?
am: በድረ-ገጽ ላይ ችግሮች አሉ?

source: Product Help
am: የምርት እገዛ

source: Product Promise
am: የምርት ቃል-ኪዳን

source: Products
am: ምርቶች

source: Projects
am: ፕሮጀክቶች

source: Projects that help keep the internet open and accessible for all.
am: በይነመረብ ክፍት እና ለሁሉም ተደራሽ እንዲሆን የሚረዱ ፕሮጀክቶች።

source: Protection for up to { $devices } devices
am: እስከ { $devices } መሳሪያዎች ድረስ ጥበቃ ያለው

source: Protect your browser’s connection to the internet.
am: አሳሽዎን ከበይነመረቡ ጋር ያለውን ግንኙነት ይጠብቁ።

source: Protect your entire device and all applications. Mask your real location and connect up to 5 devices. Subscribe now.
am: የእርስዎን መሣሪያ እና ሁሉንም መተግበሪያዎች ይጠብቁ። እውነተኛ አካባቢዎን ይሸፍኑ እና እስከ 5 የሚደርሱ መሳሪያዎችን ያገናኙ። አሁን ይመዝገቡ።

source: Protect your identity with secure phone and email masking
am: ደህንነቱ በተጠበቀ የስልክ እና የኢሜል ጭንብል ማንነትዎን ይጠብቁ

source: Protect your life online with a whole family of privacy-first products.
am: ከመላው የግላዊነት-የመጀመሪያ ምርቶች ቤተሰብ ጋር ህይወትዎን በመስመር ላይ ይጠብቁ።

source: Protect your real email address to help control your inbox.
am: የገቢ መልእክት ሳጥንዎን ለመቆጣጠር እንዲረዳዎት ትክክለኛ የኢሜይል አድራሻዎን ይጠብቁ።

source: Read about new { -brand-name-firefox } features, and get tips for staying safer online.
am: ስለ አዲስ የ{ -brand-name-firefox } ባህሪያት ያንብቡ፣ እና በመስመር ላይ ደህንነትዎን ለመጠበቅ ጠቃሚ ምክሮችን ያግኙ።

source: Read about new { -brand-name-firefox } features and ways to stay safe online.
am: ስለ አዲስ የ{ -brand-name-firefox } ባህሪያት እና መስመር ላይ ደህንነትን መጠበቂያ መንገዶች ያንብቡ።

source: Read in a quiet, private space
am: ፀጥ ባለ ፣ የግል ቦታ ውስጥ ያንብቡ

source: Read our Internet Health Report
am: የእኛን የበይነመረብ ጤና ዘገባ ያንብቡ

source: Read our manifesto
am: የእኛን የአቋም መግለጫ ያንብቡ

source: Read the <a href="{ $url }">Release Notes</a> to know more about what’s new in your { -brand-name-firefox } browser.
am: በእርስዎ { -brand-name-firefox } አሳሽ ውስጥ ስላለው አዲስ ነገር የበለጠ ለማወቅ <a href="{ $url }">የልቀት ማስታወሻዎችን</a>ን ያንብቡ።

source: Refund Policy
am: የተመላሽ ገንዘብ ፖሊሲ

source: Related posts
am: ተዛማጅ ልጥፎች

source: Relay Premium
am: ፕሪሚየም አስተላላፊ

source: Report an issue
am: ችግር መኖሩን አሳውቅ

source: Resources for developers, by developers.
am: ግብዓቶች ለገንቢዎች፣ በገንቢዎች።

source: Safe Passwords
am: አስተማማኝ የይለፍ ቃላት

source: Same speed and safety you trust, designed just for business.
am: እርስዎ የሚያምኑት ተመሳሳይ ፍጥነት እና ደህንነት፣ ለንግድ ብቻ የተነደፈ።

source: Save and discover the best stories from across the web.
am: ከመላው ድር የመጡ ምርጥ ታሪኮችን ያስቀምጡ እና ያግኙ።

source: Save articles from across the web
am: ከመላው ድር ላይ ጽሑፎችን ያስቀምጡ

source: Save content. Absorb knowledge.
am: ይዘት አስቀምጥ። እውቀትን መሳብ።

source: Save { $percent }%
am: { $percent }% ይቆጥቡ

source: Save { $percent }% on { -brand-name-mozilla-vpn }*
am: { -brand-name-mozilla-vpn }* ላይ { $percent }% ይቆጥቡ

source: Save quality content from anywhere. Fuel your mind everywhere.
am: ጥራት ያለው ይዘት ከየትኛውም ቦታ ያስቀምጡ። አእምሮዎን በሁሉም ቦታ ያነቃቁ።

source: Securely sync your passwords, bookmarks and tabs across all your devices. Get a { -brand-name-firefox-account } now – One login – Power and privacy everywhere.
am: የእርስዎን የይለፍ ቃላት፣ ዕልባቶች እና ትሮች በሁሉም መሳሪያዎችዎ ላይ ደህንነቱ በተጠበቀ ሁኔታ ያዛምዱ። አሁን { -brand-name-firefox-account } ያግኙ - አንድ መግቢያ - አቅም እና ግላዊነት በሁሉም ቦታ።

source: Security and Privacy
am: ደህንነት እና ግላዊነት

source: Security and <strong>Privacy</strong>
am: ደህንነት እና <strong>ግላዊነት</strong>

source: Security Tips
am: የደህንነት ምክሮች

source: See all browsers
am: ሁሉንም አሳሾች ይመልከቱ

source: See Breaches
am: ጥሰቶችን ይመልከቱ

source: See how { -brand-name-firefox } for desktop stacks up to seven other browsers.
am: { -brand-name-firefox } ለዴስክቶፕ እስከ ሰባት ሌሎች አሳሾች እንዴት እንደሚጠቀልል ይመልከቱ።

source: See how { -brand-name-firefox } for mobile stacks up to five other mobile browsers.
am: { -brand-name-firefox } ለተንቀሳቃሽ ስልክ እንዴት እስከ አምስት ሌሎች የተንቀሳቃሽ ስልክ አሳሾች እንደሚከማች ይመልከቱ።

source: See how { -brand-name-firefox } for <strong>desktop</strong> stacks up to seven other browsers.
am: { -brand-name-firefox } ለ<strong>ዴስክቶፕ</strong> እስከ ሰባት ሌሎች አሳሾች እንዴት እንደሚጠቀልል ይመልከቱ።

source: See how { -brand-name-firefox } stacks up against other popular browsers when it comes to the big three: privacy, features and syncing.
am: ወደ ትላልቆቹ ሦስቱ ጉዳዮች ግላዊነት፣ ባህሪያት እና ማመሳሰል ሲመጣ { -brand-name-firefox } ከሌሎች ታዋቂ አሳሾች አንፃር እንዴት እንደሚልቅ ይመልከቱ፡ ።

source: See if your email has appeared in a company’s data breach.
am: ኢሜልዎ በኩባንያው የውሂብ ጥሰት ውስጥ መኖሩን ይመልከቱ።

source: See if your personal info has been leaked online, and sign up for future breach alerts.
am: የግል መረጃዎ በመስመር ላይ መውጣቱን ይመልከቱ እና ለወደፊት የጥሰት ማንቂያዎች ይመዝገቡ።

source: See if your personal information has been compromised in a corporate data breach, and sign up for future alerts.
am: የግል መረጃዎ በድርጅት ውሂብ ጥሰት ውስጥ ተጋላጭነቱን ይመልከቱ እና ለወደፊት ማንቂያዎች እንዲደርስዎ ይመዝገቡ።

source: See our full list of <a href="{ $url }" { $attrs }>servers</a>.
am: የእኛን ሙሉ የ<a href="{ $url }" { $attrs }>አገልጋዮች</a> ዝርዝር ይመልከቱ።

source: See pricing & availability
am: ዋጋን እና ተገኝነትን ይመልከቱ

source: Send a file
am: ፋይል ላክ

source: Send { -brand-name-firefox } to your phone<br> and unleash your Internet.
am: { -brand-name-firefox } ወደ ስልክዎ ይላኩ<br> እና በይነመረብዎን ያስለቅቁ።

source: Send your large files and sensitive documents safely, up to 2.5G.
am: እስከ 2.5ጂ ድረስ ትላልቅ ፋይሎችዎን እና ሚስጥራዊነት ያላቸውን ሰነዶች በጥንቃቄ ይላኩ።

source: { $servers }+ servers in { $countries }+ countries
am: { $servers }+ አገልጋዮች በ{ $countries }+ አገሮች

source: Seven of the best browsers in direct comparison
am: በቀጥታ ንጽጽር ውስጥ ሰባት ምርጥ አሳሾች

source: Shapes Editor
am: ቅርጾች አርታዒ

source: Share large files safely, with links that ‘self-destruct’.
am: ትላልቅ ፋይሎችን ‘ራስን በሚያጠፉ’ አገናኞች በአስተማማኝ ሁኔታ አጋራ።

source: Sign In to { -brand-name-monitor }
am: ወደ { -brand-name-monitor } ይግቡ

source: Sign in to your { -brand-name-firefox-account } to:
am: ወደ እርስዎ { -brand-name-firefox-account } ይግቡ ለ፡-

source: Sign in to your { -brand-name-mozilla-account } to:
am: ወደ እርስዎ { -brand-name-mozilla-account } ይግቡ ለ:-

source: Sign Up
am: ይመዝገቡ

source: Sign up for a free account and sync all your passwords, browsing history, and preferences across your devices.
am: ለነጻ መለያ ይመዝገቡ እና ሁሉንም የይለፍ ቃላትዎን፣ የአሰሳ ታሪክዎን እና ምርጫዎችዎን በተለያዩ መሳሪያዎችዎ ላይ ያመሳስሉ።

source: Sign up for breach alerts
am: የጥሰት ማንቂያዎች እንዲደርስዎ ይመዝገቡ

source: Sign up for new accounts without handing over your email address.
am: የኢሜል አድራሻዎን ሳያስረክቡ ለአዲስ መለያዎች ይመዝገቡ።

source: Simply private mobile browsing.
am: በቀላሉ የግል የሞባይል አሰሳ።

source: Since { -brand-name-edge } has moved to the processor intensive { -brand-name-chromium } platform, you can expect it to run a little slower, especially if you have multiple programs running at once. However, with { -brand-name-chromium } platform comes a massive library of extensions as well as a decent level of UI customization that { -brand-name-edge } did not have before its move to { -brand-name-chromium }.
am: { -brand-name-edge } ወደ ተጠናከረ አስቻይ { -brand-name-chromium } መድረክ ስለሄደ፣ በተለይ በአንድ ጊዜ የሚሰሩ ብዙ ፕሮግራሞች ካሉዎት ትንሽ ሊዘገይ እንደሚችል መጠርጠር ይችላሉ። ነገር ግን፣ በ{ -brand-name-chromium } የመሳሪያ ስርዓት ወደ { -brand-name-chromium } ከመሄዱ በፊት ያልነበረው ሰፊ የቅጥያዎች ቤተ-መተግበሪያዎች እና እንዲሁም ጥሩ የUI መስሪያ ደረጃ ይመጣል።

source: Since your browser is your gateway to the internet, speed, security, privacy and utility are paramount. In recent years, { -brand-name-google } { -brand-name-chrome } has been the browser of choice for many. But at a time when online ads seem to follow us everywhere and data breaches are a fixture of news headlines, a lot of people are starting to demand more privacy and respect from their browser.
am: አሳሽዎ የበይነመረብ መግቢያዎ ስለሆነ ፍጥነት፣ደህንነት፣ ግላዊነት እና መገልገያ ከሁሉም በላይ ናቸው። በቅርብ ዓመታት ውስጥ { -brand-name-google } { -brand-name-chrome } ለብዙዎች ተመራጭ አሳሽ ናቸው። ነገር ግን የመስመር ላይ ማስታወቂያዎች በየቦታው እኛን የሚከተሉ በሚመስሉበት እና የውሂብ መጣስ የዜና አርዕስተ ዜናዎች ሲሆኑ፣ ብዙ ሰዎች ከአሳሻቸው የበለጠ ግላዊነት እና ክብር መጠየቅ ጀምረዋል።

source: Six of the best browsers in direct comparison
am: በቀጥታ ንጽጽር ውስጥ ስድስት ምርጥ አሳሾች

source: So is your browser the best one for what you do online? The right browser can make a big difference in how you experience the web. So, without further ado, let’s compare { -brand-name-google } { -brand-name-chrome }, { -brand-name-firefox }, { -brand-name-safari }, { -brand-name-opera }, { -brand-name-brave }, { -brand-name-microsoft } { -brand-name-ie } and { -brand-name-edge } — and see which best suits your needs.
am: ስለዚህ በመስመር ላይ ለሚያደርጉት ነገር የእርስዎ አሳሽ በጣም ጥሩው ነው? ትክክለኛው አሳሽ ድሩን በሚለማመዱበት ሁኔታ ላይ ትልቅ ለውጥ ሊያመጣ ይችላል። እንግዲያው፣ ያለ ተጨማሪ ወሬ፣ { -brand-name-google } { -brand-name-chrome }፣ { -brand-name-firefox }፣ { -brand-name-safari }፣ { -brand-name-opera }፣ { -brand-name-brave }፣ { -brand-name-microsoft }፣ { -brand-name-ie } እና { -brand-name-edge } እናወዳድር እና የትኛው ለእርስዎ ፍላጎት እንደሚስማማ ይመልከቱ።

source: So is your browser the best one for what you do online? The right browser can make a big difference in how you experience the web. So, without further ado, let’s compare { -brand-name-google } { -brand-name-chrome }, { -brand-name-firefox }, { -brand-name-safari }, { -brand-name-opera }, { -brand-name-microsoft } { -brand-name-ie } and { -brand-name-edge } — and see which best suits your needs.
am: ስለዚህ በመስመር ላይ ለሚያደርጉት ነገር የእርስዎ አሳሽ በጣም ጥሩው ነው? ትክክለኛው አሳሽ ድሩን በሚለማመዱበት ሁኔታ ላይ ትልቅ ለውጥ ሊያመጣ ይችላል። እንግዲያው፣ ያለ ተጨማሪ ወሬ፣ { -brand-name-google } { -brand-name-chrome }፣ { -brand-name-firefox }፣ { -brand-name-safari }፣ { -brand-name-opera }፣ { -brand-name-microsoft } { -brand-name-ie } እና { -brand-name-edge } እናወዳድር እና የትኛው ለእርስዎ ፍላጎት እንደሚስማማ ይመልከቱ።

source: Sorry, { -brand-name-mozilla-vpn } is not available for download in your country.
am: ይቅርታ፣ { -brand-name-mozilla-vpn } ባሉበት አገር ለማውረድ አይገኝም።

source: <span>Save { $percent }%</span> on { -brand-name-relay-premium } yearly plan
am: በ{ -brand-name-relay-premium } ዓመታዊ ዕቅድ ላይ <span>{ $percent }% ይቆጥቡ</span>

source: Spell checking
am: የፊደል ማረም

source: Start protecting your identity today
am: ማንነትዎን መጠበቅ ዛሬ ይጀምሩ

source: Stories about how our people and products are changing the world for the better.
am: የእኛ ሰዎች እና ምርቶች እንዴት ዓለምን በተሻለ ሁኔታ እንደሚለውጡ የሚያወሱ ትርክቶች።

source: Strap on your goggles and step into the immersive web with { -brand-name-firefox-browser } for VR.
am: መነፅርን ታጥቀው ወደ አስማጭ ድር በ{ -brand-name-firefox-browser } ለቪአር ግባ።

source: <strong>Enter your email</strong> to access { -brand-name-firefox-accounts }.
am: { -brand-name-firefox-accounts }ን ለመድረስ <strong>ኢሜልዎን ያስገቡ</strong>።

source: <strong>Portability</strong>
am: <strong>ተንቀሳቃሽነት</strong>

source: Strong servers in { $countries }+ countries
am: በ{ $countries }+ አገሮች ውስጥ ያሉ ጠንካራ አገልጋዮች

source: <strong>Utility</strong>
am: <strong>መገልገያ</strong>

source: Subscribe to { -brand-name-mozilla-vpn }
am: ለ{ -brand-name-mozilla-vpn } ይመዝገቡ

source: Subscribe to our newsletter, join Mozillians all around the world, and learn about impactful opportunities to support the { -brand-name-mozilla } mission.
am: ለጋዜጣችን ደንበኝነት ይመዝገቡ፣ በመላው አለም የሚገኙ ሞዚሊያኖችን ይቀላቀሉ እና የ{ -brand-name-mozilla } ተልዕኮን ለመደገፍ ስለ ጠቃሚ እድሎች ይወቁ።

source: Super Fast
am: እጅግ በጣም ፈጣን

source: Supported Devices
am: የሚደገፉ መሣሪያዎች

source: Surf, stream and get work done on servers in over 30 countries for a secure internet connection with a new perspective.
am: ደህንነቱ የተጠበቀ የበይነመረብ ግንኙነት ከአዲስ እይታ ጋር ለማግኘት ከ30 በላይ ሀገራት ባሉ አገልጋዮች ላይ አሰሳ፣ ዥረት መልቀቅ እና ስራዎችን ሰራ።

source: Syncs with mobile
am: ከስልክ ጋር ይመሳሰል

source: Tab browsing
am: የትር አሰሳ

source: Take { -brand-name-firefox } and { -brand-name-firefox-focus } with you. For { -brand-name-android } and { -brand-name-ios }.
am: { -brand-name-firefox } እና { -brand-name-firefox-focus }ን ከእርስዎ ጋር ይውሰዱ። ለ{ -brand-name-android } እና { -brand-name-ios }።

source: Take speed, privacy and peace of mind with you. On { -brand-name-android } and { -brand-name-ios }.
am: ፍጥነትን፣ ግላዊነትን እና የአእምሮ ሰላምን ከእርስዎ ጋር ይውሰዱ። በ{ -brand-name-android } እና { -brand-name-ios } ላይ።

source: Take the passwords you’ve saved in { -brand-name-firefox } with you everywhere.
am: በ{ -brand-name-firefox } ውስጥ ያስቀመጧቸውን የይለፍ ቃሎች በሁሉም ቦታ ከእርስዎ ጋር ይውሰዱ።

source: Technical
am: ሙያዊ

source: Technical and Non-technical
am: ሙያዊ እና ሙያዊ ያልሆኑ

source: Terms and Conditions
am: አተገባበር እና መመሪያ

source: Test New Features
am: አዲስ ባህሪያትን ይሞክሩ

source: Test soon-to-be-released features in our most stable pre-release build.
am: በጣም በተረጋጋ የቅድመ-ልቀት ግንባታችን ውስጥ በቅርቡ የሚለቀቁ ባህሪያትን ይሞክሩ።

source: Text to speech
am: ጽሑፍ ወደ ንግግር

source: The ability to sync your passwords, extensions, form data, add-ons and other preferences across all your devices and operating systems is a feature that’s been available for years with { -brand-name-firefox }. The synced data is also encrypted, which means no one can access it from the outside.
am: የእርስዎን የይለፍ ቃላት፣ ቅጥያዎች፣ የቅጽ ውሂብ፣ ተጨማሪዎች እና ሌሎች ምርጫዎችዎን በሁሉም መሳሪያዎችዎ እና ስርዓተ ክዋኔዎችዎ ላይ የማመሳሰል ችሎታ በ{ -brand-name-firefox } ለዓመታት የሚገኝ ባህሪ ነው። የተመሳሰለው መረጃም የተመሰጠረ ነው፣ ይህ ማለት ማንም ከውጭ ሊያገኘው አይችልም።

source: The bottom line is that even though { -brand-name-brave }’s revenue model with the Basic Attention Tokens may be too complex for a lot of users, overall both { -brand-name-brave } and { -brand-name-firefox } browsers offer a variety of ways to enjoy a safe and private browsing experience.
am: ዋናው ነገር በምን ሁኔታ{ -brand-name-brave } ምንም እንኳን ከመሠረታዊ ትኩረት ቶክኖች ጋር ያለው የገቢ ሞዴል ለብዙ ተጠቃሚዎች በጣም ውስብስብ ሊሆን ቢችልም በአጠቃላይ ሁለቱም { -brand-name-brave } እና{ -brand-name-firefox }አሳሾች ደህንነቱ የተጠበቀ እና አስደሳች የግል አሰሳን በተለያዩ መንገዶችን ይሰጣሉ።

source: The bottom line is that while we suggest using { -brand-name-firefox }, the best browser for you ultimately will be the one that fits your individual needs with extension support, browser customization, speed, privacy and security.
am: ዋናው ቁም ነገር { -brand-name-firefox }ን ለመጠቀም ብንጠቁም ለናንተ ምርጡ አሳሽ በመጨረሻ ከቅጥያ ድጋፍ፣ ከአሳሽ ማበጀት፣ ፍጥነት፣ ግላዊነት እና ደህንነት ጋር የግል ፍላጎቶችዎን የሚያሟላ ነው።

source: The { -brand-name-brave } browser, like so many others, is built on the open-source { -brand-name-chromium } code by { -brand-name-google }. Open-source means anyone can use the source code and piggy-back on top of it to build whatever they want — like the <a { $opera }>{ -brand-name-opera }</a> and <a { $edge }>{ -brand-name-edge }</a> browsers. But it doesn’t mean that all { -brand-name-chromium }-based browsers are equal or are themselves open source.
am: የ{ -brand-name-brave } አሳሽ፣ ልክ እንደሌሎች ብዙዎች፣ በክፍት ምንጭ { -brand-name-chromium } ኮድ በ{ -brand-name-google } ላይ ነው የተሰራው። ክፍት ምንጭ ማለት ማንኛውም ሰው የፈለገውን ለመገንባት የምንጭ ኮዱን እና ፒጊ-ጀርባን መጠቀም ይችላል - እንደ <a { $opera }>{ -brand-name-opera }</a> እና <a { $edge }>{ -brand-name-edge }</a> አሳሾች። ግን ሁሉም በ{ -brand-name-chromium } ላይ የተመሰረቱ አሳሾች እኩል ናቸው ወይም እራሳቸው ክፍት ምንጭ ናቸው ማለት አይደለም።

source: The { -brand-name-facebook-container } Extension is currently only available for { -brand-name-firefox } for Desktop.
am: የ{ -brand-name-facebook-container } ቅጥያው በአሁኑ ጊዜ ለ{ -brand-name-firefox } ለዴስክቶፕ ብቻ ይገኛል።

source: The { -brand-name-facebook-container } Extension is not available on mobile devices.
am: የ{ -brand-name-facebook-container } ቅጥያው በሞባይል መሳሪያዎች ላይ አይገኝም።

source: The { -brand-name-firefox } browser also gives users the ability to sign up for a free <a { $accounts }>{ -brand-name-firefox-account }</a>. Having a { -brand-name-firefox } account is the key to unlocking syncing across devices, plus you get the added benefit of products like <a { $monitor }>{ -brand-name-firefox-monitor }</a> which monitors your email addresses and alerts you if any of your information has been involved in any known <a { $breaches }>data breaches</a>.
am: የ{ -brand-name-firefox } አሳሽ ለተጠቃሚዎች በነጻ የመመዝገብ ችሎታን ይሰጣል <a { $accounts }>{ -brand-name-firefox-account }</a>። የ{ -brand-name-firefox } መለያ መኖሩ በሁሉም መሳሪያዎች ላይ ማመሳሰልን ለመክፈት ቁልፉ ነው፣ በተጨማሪም እንደ <a { $monitor }>{ -brand-name-firefox-monitor }</a> ያሉ ምርቶች ተጨማሪ ጥቅም ያገኛሉ። የኢሜል አድራሻዎን የሚከታተል እና የትኛውም መረጃዎ በማናቸውም በሚታወቁ <a { $breaches }>የውሂብ ጥሰቶች</a> ውስጥ ከተሳተፈ ያሳውቅዎታል።

source: The { -brand-name-firefox-browser } and { -brand-name-opera } are two of the earliest browsers on the scene still releasing frequent updates. While { -brand-name-opera } has not reached the same level of user adoption as { -brand-name-firefox } or { -brand-name-google } { -brand-name-chrome }, it’s maintained a relatively stable and loyal base over a sustained period of time. In this review, we’ll compare the { -brand-name-opera } browser with our { -brand-name-firefox } browser in terms of security and privacy, utility, and portability to help you choose which browser might be the best fit for you.
am: የ{ -brand-name-firefox-browser } እና { -brand-name-opera } አሁንም ተደጋጋሚ ዝመናዎችን እየለቀቁ ካሉት ቀደምት አሳሾች ናቸው። { -brand-name-opera } ከ{ -brand-name-firefox } ወይም { -brand-name-google } { -brand-name-chrome } ጋር ተመሳሳይ የተጠቃሚ ጉዲፈቻ ደረጃ ላይ ባይደርስም፣ በአንጻራዊ ሁኔታ የተረጋጋ ሆኖ ቆይቷል። እና ታማኝ መሠረት በቋሚ ጊዜ ውስጥ። በዚህ ግምገማ የ{ -brand-name-opera } አሳሹን ከ{ -brand-name-firefox } ማሰሻችን ከደህንነት እና ግላዊነት፣ መገልገያ እና ተንቀሳቃሽነት አንፃር እናነፃፅራለን የትኛው አሳሽ የተሻለ ሊሆን እንደሚችል እና ለእርስዎ ተስማሚ የሚሆነውን እንዲመርጡ ይረዳዎታል።

source: The { -brand-name-mozilla } community, together with other open source projects and other public benefit organizations, exists only because of the people who are engaged in making our common goals a reality.
am: የ{ -brand-name-mozilla } ማህበረሰብ፣ ሌሎች ክፍት ምንጭ ፕሮጄክቶች እና ሌሎች ለሕዝብ-ጥቅም የቆሙ ድርጅቶችን ጨምሮ መኖር የቻሉት የጋራ ግቦቻችንን እውን ለማድረግ በተሰማሩ ሰዎች ምክንያት ብቻ ነው።

source: The { -brand-name-mozilla } project was <a href="{ $coderush }">created in 1998</a> with the <a href="{ $sourcerelease }">release of the { -brand-name-netscape } browser suite source code</a>.
am: የ{ -brand-name-mozilla } ፕሮጀክት በ<a href="{ $coderush }">በ1998</a> ተመፈጠረ በ<a href="{ $sourcerelease }">የ{ -brand-name-netscape }የአሳሽ ስብስብ ምንጭ ኮድ ተለቀቀ</a>።

source: The { -brand-name-mozilla-vpn } runs on a global network of servers powered by <a href="{ $policy }">{ -brand-name-mullvad }</a> using the <a href="{ $wireguard }">{ -brand-name-wireguard }</a>® protocol. { -brand-name-mullvad } puts your privacy first and does not keep logs of any kind.
am: የ{ -brand-name-mozilla-vpn } በ<a href="{ $policy }">{ -brand-name-mullvad }</a> በተሰራ <a href="{ $wireguard }">{ -brand-name-wireguard }</a>® ፕሮቶኮልን በመጠቀም ዓለምአቀፍ የአገልጋዮች አውታረ መረብ ላይ ይሰራል። { -brand-name-mullvad } የእርስዎን ግላዊነት ያስቀድማል እና ምንም ዓይነት ማስታወሻዎችን መዝገቦ አያስቀምጥም።

source: The community has shown that commercial companies can benefit by collaborating in open source projects and that great end user products can be produced as open source software.
am: ህብረተሰቡ የንግድ ኩባንያዎች በክፍት ምንጭ ፕሮጄክቶች ውስጥ በመተባበር ተጠቃሚ ሊሆኑ እንደሚችሉ እና ምርጥ ተጠቃሚ ምርቶችን እንደ ክፍት ምንጭ ሶፍትዌር ማምረት እንደሚቻል አሳይቷል ።

source: The comparisons made here were done so across browser release versions as follows:
am: እዚህ የተደረጉ ንጽጽሮች በአሳሽ ልቀት ስሪቶች ላይ እንደሚከተለው ተካሂደዋል፡

source: The comparisons made here were done so with default settings and across browser release versions as follows:
am: እዚህ የተደረጉ ንፅፅሮች በነባሪ ቅንጅቶች እና በአሳሽ መልቀቂያ ስሪቶች ላይ እንደሚከተለው ተከናውነዋ:

source: The Coral Project
am: የኮራል ፕሮጀክት
